tutorials/incompressible/pimpleDyMFoam/axialTurbine/0_orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    GVINLET
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    GVOUTLET
    {
        type            overlapGgi;
    }
    GVCYCLIC1
    {
        type            cyclicGgi;
    }
    GVCYCLIC2
    {
        type            cyclicGgi;
    }
    GVBLADE
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
    GVHUB
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
    GVSHROUD
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
    RUINLET
    {
        type            overlapGgi;
    }
    RUOUTLET
    {
        type            overlapGgi;
    }
    RUCYCLIC1
    {
        type            cyclicGgi;
    }
    RUCYCLIC2
    {
        type            cyclicGgi;
    }
    RUBLADE
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
    RUHUB
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
    RUSHROUD
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
    DTINLET
    {
        type            overlapGgi;
    }
    DTOUTLET
    {
        type            zeroGradient;
    }
    DTCYCLIC1
    {
        type            cyclicGgi;
    }
    DTCYCLIC2
    {
        type            cyclicGgi;
    }
    DTHUB
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
    DTSHROUD
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 14.855;
    }
}

// ************************************************************************* //
